tutorials/laminar/damBreak/Allrun
#!/bin/sh

# Create the mesh
blockMesh

# create the intial time folder
cp -r 0_org 0

setFields

# Run sedFoam
sedInterFoam > log &


