tutorials/laminar/damBreak/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
// alphaEqn
    div(phi,gamma) Gauss vanLeer;
    div(phir,gamma) Gauss linear;
    div(phi,alphas) Gauss vanLeer;
    div(phir,alphas) Gauss linear;
    div(U.flu) Gauss linear;
// UEqn
    div(phi.sol,U.sol) Gauss linearUpwind grad(U);
    div(phi.flu,U.flu) Gauss linearUpwind grad(U);
    div(rhoPhi,U) Gauss linearUpwind grad(U);
    div(rhoPhi,U.flu) Gauss linearUpwind grad(U);
    div((rho*phif),Uf) Gauss linearUpwind grad(U);
    div((rho*Rcs)) Gauss linear;
    div(phiRs,Us) Gauss linear;
    div((rho*phi.sol),U.sol) Gauss linearUpwind grad(U);
    div((rhof*Rcf)) Gauss linear;
    div(phiRf,Uf) Gauss linear;
    div((muf*dev2(T(grad(U))))) Gauss linear;
    div((interpolate(rhof)*phif),Uf) Gauss linear;
// pEqn
    div(phis,ps_new_value) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default  linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    alpha.wat;
    alpha.sol;
    gamma;
    p_rgh;
}


// ************************************************************************* //
