tutorials/laminar/damBreak/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue gamma 0
    volScalarFieldValue alpha.wat 0
    volScalarFieldValue alpha.sol 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.1496 0.292 1);
        fieldValues
        (
            volScalarFieldValue gamma 1
        );
    }
    /*boxToCell
    {
        box (0 0 -1) (0.2 0.15 1);
        fieldValues
        (
            volScalarFieldValue alpha.sol 0.3
        );
    }*/
);


// ************************************************************************* //
